# TABLE OF CONTENTS
### 01. Importing Libraries
### 02. Importing Data
### 03. Data Wrangling
### 04. Consistency check
### 05. Merging prep Merging will happen in Kaggle due ot processing power

# 01. Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 02. Importing Data

In [2]:
path = r'C:\Users\gabri\OneDrive\Desktop\CF Data Analysys Course\Data Analytics Immersion\A4 Achivement\Instacart Basket Analysis'

In [3]:
# customers dataframe
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# all the other dataframes merged, prepared and downcasted
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', '4_8_orders_prior_products_merge_downcasted_derived_correted.pkl'))

In [6]:
ords_prods_merge.head()

,order_id,user_id,order_sequence_per_user,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,_merge,price_range_loc,busiest_days,busiest_periods_of_day,max_order,loyalty_flag,average_spending,type_of_spender,median_days_prior_orders,frequent_customer
0,2539329,1,1,2,8,NaN,True,196,1,0,...,both,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,both,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,both,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,both,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,both,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

# 03. Data Wrangling

In [7]:
# checking for mixed type data
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

First Name

In [8]:
# fixing mixed data type column
customers['First Name'] = customers['First Name'].astype('str')

In [9]:
# checking if correction happend and check possible dtypes for downcasting
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    206209 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [10]:
# downcasting columns user_id, Age and n_dependents, income. Attention to user_id as key to be the same as the other dataset that was downcasted
customers['user_id'] = customers['user_id'].astype('int32')
customers['Age'] = customers['Age'].astype('int8')
customers['n_dependants'] = customers['n_dependants'].astype('int8')
customers['income'] = customers['income'].astype('int32')

In [11]:
# checking downcasting
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int32
 1   First Name    206209 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int8
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int8
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int32
dtypes: int32(2), int8(2), object(6)
memory usage: 11.4+ MB

In [12]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
# checking the logic of STATE column to rename it properly
customers['STATE'].unique()

array(['Missouri', 'New Mexico', 'Idaho', 'Iowa', 'Maryland', 'Kentucky',
       'Montana', 'South Carolina', 'Texas', 'Virginia', 'Nevada',
       'Nebraska', 'Georgia', 'Wyoming', 'Colorado', 'North Dakota',
       'Wisconsin', 'Alaska', 'Vermont', 'Arkansas', 'Maine',
       'North Carolina', 'West Virginia', 'Indiana', 'Oregon', 'Florida',
       'California', 'Pennsylvania', 'Ohio', 'Connecticut', 'Arizona',
       'Louisiana', 'Washington', 'New York', 'Mississippi', 'Oklahoma',
       'Utah', 'New Hampshire', 'Hawaii', 'District of Columbia',
       'Alabama', 'Massachusetts', 'Rhode Island', 'Michigan',
       'New Jersey', 'Kansas', 'South Dakota', 'Minnesota', 'Illinois',
       'Tennessee', 'Delaware'], dtype=object)

In [14]:
# renaming columns for standarization
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)
customers.rename(columns = {'STATE' : 'us_state'}, inplace = True)
customers.rename(columns = {'Age' : 'age'}, inplace = True)
customers.rename(columns = {'n_dependants' : 'num_of_dependants'}, inplace = True)
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)
customers.rename(columns = {'income' : 'income_in_usd'}, inplace = True)

In [15]:
customers.head()

,user_id,first_name,last_name,gender,us_state,age,date_joined,num_of_dependants,marital_status,income_in_usd
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [16]:
# renaming columns for standarization
customers.rename(columns = {'income_in_usd' : 'yearly_income'}, inplace = True)

In [18]:
# checking if column date_joined is only one value - and therefore useless
customers['date_joined'].unique()

array(['1/1/2017', '1/2/2017', '1/3/2017', ..., '3/30/2020', '3/31/2020',
       '4/1/2020'], shape=(1187,), dtype=object)

### I decided to keep column date_joined as it has different dates. But I transformed it in a date type below

In [20]:
customers['date_joined'] = pd.to_datetime(customers['date_joined'])

In [21]:
customers['date_joined'].dtype

dtype('<M8[ns]')

In [24]:
# changed to a less demanding date type
customers['date_joined'] = customers['date_joined'].values.astype('datetime64[D]')

In [25]:
customers['date_joined'].dtype

dtype('<M8[s]')

In [26]:
customers.head()

,user_id,first_name,last_name,gender,us_state,age,date_joined,num_of_dependants,marital_status,yearly_income
0,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,2017-01-01,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2017-01-01,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,2017-01-01,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,2017-01-01,1,married,40374

# 04. Consistency check

In [27]:
# check the shape
customers.shape

(206209, 10)

In [28]:
customers.describe()

,user_id,age,date_joined,num_of_dependants,yearly_income
count,206209.000000,206209.000000,206209,206209.000000,206209.000000
mean,103105.000000,49.501646,2018-08-17 03:06:30,1.499823,94632.852548
min,1.000000,18.000000,2017-01-01 00:00:00,0.000000,25903.000000
25%,51553.000000,33.000000,2017-10-23 00:00:00,0.000000,59874.000000
50%,103105.000000,49.000000,2018-08-16 00:00:00,1.000000,93547.000000
75%,154657.000000,66.000000,2019-06-10 00:00:00,3.000000,124244.000000
max,206209.000000,81.000000,2020-04-01 00:00:00,3.000000,593901.000000
std,59527.555167,18.480962,NaN,1.118433,42473.786988

In [29]:
# checking for missing data
customers.isnull().sum()

user_id              0
first_name           0
last_name            0
gender               0
us_state             0
age                  0
date_joined          0
num_of_dependants    0
marital_status       0
yearly_income        0
dtype: int64

In [30]:
# checking for duplicates
customers_dups = customers[customers.duplicated()]

In [31]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, us_state, age, date_joined, num_of_dependants, marital_status, yearly_income]
Index: []

# 05. Merging prep Merging will happen in Kaggle due ot processing power

In [32]:
ords_prods_merge.head()

,order_id,user_id,order_sequence_per_user,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,_merge,price_range_loc,busiest_days,busiest_periods_of_day,max_order,loyalty_flag,average_spending,type_of_spender,median_days_prior_orders,frequent_customer
0,2539329,1,1,2,8,NaN,True,196,1,0,...,both,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,both,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,both,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,both,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,both,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [33]:
# checking for columns to drop
ords_prods_merge.columns

Index(['order_id', 'user_id', 'order_sequence_per_user', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'new_customer',
       'product_id', 'add_to_cart_order', 'reordered', 'product_name',
       'aisle_id', 'department_id', 'prices', '_merge', 'price_range_loc',
       'busiest_days', 'busiest_periods_of_day', 'max_order', 'loyalty_flag',
       'average_spending', 'type_of_spender', 'median_days_prior_orders',
       'frequent_customer'],
      dtype='object')

In [34]:
# dropping unecessary columns _merge
ords_prods_merge_clean = ords_prods_merge.drop(columns = ['_merge'])

In [35]:
ords_prods_merge_clean.columns

Index(['order_id', 'user_id', 'order_sequence_per_user', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'new_customer',
       'product_id', 'add_to_cart_order', 'reordered', 'product_name',
       'aisle_id', 'department_id', 'prices', 'price_range_loc',
       'busiest_days', 'busiest_periods_of_day', 'max_order', 'loyalty_flag',
       'average_spending', 'type_of_spender', 'median_days_prior_orders',
       'frequent_customer'],
      dtype='object')

In [36]:
ords_prods_merge_clean.head()

,order_id,user_id,order_sequence_per_user,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,prices,price_range_loc,busiest_days,busiest_periods_of_day,max_order,loyalty_flag,average_spending,type_of_spender,median_days_prior_orders,frequent_customer
0,2539329,1,1,2,8,NaN,True,196,1,0,...,9.0,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,12.5,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,4.4,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,4.7,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,1.0,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [37]:
# prices column has issues of consistency as per 4.9 text. Checking it to correct
ords_prods_merge_clean['prices'].max()

14900.0

In [38]:
# checkin all lines with prices above threshold defined
ords_prods_merge_clean.loc[ords_prods_merge_clean['prices'] > 100]

,order_id,user_id,order_sequence_per_user,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,...,prices,price_range_loc,busiest_days,busiest_periods_of_day,max_order,loyalty_flag,average_spending,type_of_spender,median_days_prior_orders,frequent_customer
1576,912404,17,12,2,14,5.0,False,21553,5,0,...,14900.0,High-range product,Regularly busy,Most orders,40,Regular customer,108.648300,High spender,5.0,Frequent customer
1638,603376,17,22,6,16,4.0,False,21553,3,1,...,14900.0,High-range product,Regularly busy,Average orders,40,Regular customer,108.648300,High spender,5.0,Frequent customer
16522,3264360,135,2,2,21,13.0,False,21553,6,0,...,14900.0,High-range product,Regularly busy,Average orders,4,New customer,1154.792236,High spender,12.0,Regular customer
16528,892534,135,3,0,8,12.0,False,21553,3,1,...,14900.0,High-range product,Busiest day,Average orders,4,New customer,1154.792236,High spender,12.0,Regular customer
53672,229704,342,8,1,19,30.0,False,21553,9,0,...,14900.0,High-range product,Busiest day,Average orders,16,Regular customer,114.426620,High spender,23.0,Non-frequent customer
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32320511,3172853,205650,18,1,9,7.0,False,21553,17,1,...,14900.0,High-range product,Busiest day,Average orders,25,Regular customer,351.141632,High spender,6.0,Frequent customer
32347717,2504315,205818,3,5,15,3.0,False,21553,13,0,...,14900.0,High-range product,Regularly busy,Most orders,25,Regular customer,170.073776,High spender,13.0,Regular customer
32347727,1108388,205818,5,4,5,1.0,False,21553,5,1,...,14900.0,High-range product,Least busy,Fewest orders,25,Regular customer,170.073776,High spender,13.0,Regular customer
32380527,1916142,206049,1,2,17,NaN,True,21553,2,0,...,14900.0,High-range product,Regularly busy,Average orders,5,New customer,938.031250,High spender,7.0,Frequent customer
32380551,379732,206049,4,1,14,5.0,False,21553,4,1,...,14900.0,High-range product,Busiest day,Most orders,5,New customer,938.031250,High spender,7.0,Frequent customer

In [39]:
# checkin all product_id that have high prices
ords_prods_merge_clean.loc[ords_prods_merge_clean['prices'] > 100, 'product_id'].unique()

array([21553], dtype=int32)

In [40]:
# check which product it is
ords_prods_merge_clean.loc[ords_prods_merge_clean['product_id'] == 21553, 'product_name'].unique()

array(['Lowfat 2% Milkfat Cottage Cheese'], dtype=object)

In [41]:
# temporarily show all rows in notebook
pd.set_option('display.max_rows', None)

In [42]:
# checking for names that contain 'cottage' and 'cheese' and '2' and 'milk' while excluding 'curd' to see if there was a data corruption or typos while inserting data
ords_prods_merge_clean.loc[
    ords_prods_merge_clean['product_name'].str.contains('cottage', case=False, na=False) &
    ords_prods_merge_clean['product_name'].str.contains('2', case=False, na=False) &
    ords_prods_merge_clean['product_name'].str.contains('milk', case=False, na=False) &
    ords_prods_merge_clean['product_name'].str.contains('cheese', case=False, na=False) &
    ~ords_prods_merge_clean['product_name'].str.contains('curd', case=False, na=False),
    ['product_id', 'product_name', 'prices']
    ].drop_duplicates().sort_values('product_name')

,product_id,product_name,prices
3640563,14065,"Cottage Cheese 2% Milkfat Lowfat,Blueberry Top...",11.8
250329,11203,"Cottage Doubles Peach, 2% Milkfat Lowfat Cotta...",2.4
2559037,195,Grade A Pasteurized 2% Milkfat Lowfat Cottage ...,3.3
1576,21553,Lowfat 2% Milkfat Cottage Cheese,14900.0
456916,28662,Strawberry 2% Milkfat Cottage Cheese,3.0

### As there is no product that looks like it is the same, I decided to change the prices above 100 as per exercise description. Note that the 99999 had been corrected before and has correct price now

In [43]:
# substituting prices above 100 to NaN
ords_prods_merge_clean.loc[ords_prods_merge_clean['prices'] >100, 'prices'] = np.nan

In [44]:
# check if corrections was done
ords_prods_merge_clean.loc[ords_prods_merge_clean['prices'] > 100]

Empty DataFrame
Columns: [order_id, user_id, order_sequence_per_user, orders_day_of_week, order_hour_of_day, days_since_prior_order, new_customer, product_id, add_to_cart_order, reordered, product_name, aisle_id, department_id, prices, price_range_loc, busiest_days, busiest_periods_of_day, max_order, loyalty_flag, average_spending, type_of_spender, median_days_prior_orders, frequent_customer]
Index: []

[0 rows x 23 columns]

In [45]:
# reset to show max rows as default properties
pd.reset_option('display.max_rows')

In [46]:
ords_prods_merge_clean.shape

(32404859, 23)

In [47]:
customers.shape

(206209, 10)

In [48]:
# Exporting customer dataframe to perofrm the merging in Kaggle
customers.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'customers_checked.pkl'))

In [49]:
# Exporting ords_prods_merge_clean dataframe to perofrm the merging in Kaggle
ords_prods_merge_clean.to_pickle(os.path.join(path, '02 Data','Prepared Data', '4_9_ords_prods_ready_for_merge.pkl'))